[
    {
        "name": "Verden MIK Cargo Trunk Bag",
        "shortDescription": "A versatile trunk bag designed to fit a wide range of cargo that quickly and securely mounts to compatible MIK racks.",
        "description": "## Overview\nMake your bike rides more enjoyable with the Verden MIK Cargo Trunk Bag. This trunk bag offers simple and secure on-bike storage, with easy installation and removal without the need for any tools. It features multiple pockets to keep you organized, a durable design with reflective materials for enhanced visibility, and an integrated rain cover to protect you and your gear in all weather conditions.\n\n### Product Details\n- MIK mounting system provides secure, integrated mounting with compatible racks\n- Enhance visibility with front and rear reflective materials in a sleek black finish\n- Stay organized with an internal mesh pocket and two side pockets, each with a smaller internal pocket\n- Securely store your phone in the zippered pocket with soft lining, easily accessible from the top of the bag\n- Be prepared for any weather with the integrated rain cover securely stowed in the rear pocket\n- Convenient light loop for easy mounting of your rear light\n- Adjustable carrying strap for convenient off-bike use\n\n## Features\nFunction, performance, and style\n\nVerden City Utility bags, Verden City Shopping Trunk bags, and Verden Panniers transform any bike into a stylish and practical utility ride. Crafted with high-end fabrics and thoughtful finishing materials, these bags strike the perfect balance between great looks and exceptional functionality.\n\n### MIK: Mounting is Key\nMIK racks and bags feature a unique keyed installation system that ensures your bags are securely attached to your rack while still allowing for easy removal when needed.\n\n### How MIK Works\nSimply slide the Verden MIK bag onto the MIK rack. Once you hear a click, the installation is complete. To remove the bag, insert the key and press. The bag will then be released and ready to be detached.\n\n### Better Together\nOur bags and racks are designed as a complete system, making installation and removal a breeze while ensuring your valuable cargo remains secure throughout your rides.\n\n### Integrated Light Mounting\nFor improved visibility at all times, our racks and trunk bags feature a dedicated spot to easily mount your rear light.\n\n## Specs\n- Cargo capacity: 13L\n- Bag type: Trunk bags\n- Dimensions: 35cm (length) x 20cm (width) x 20cm (height)\n- Attachment: MIK\n- Fiber content: 35% Poly 600 PU Coating / 30% Poly 840 PU Coating / 15% 3M Silver Reflective Mesh / 11% Nylon Mesh / 9% Poly Super Nylex Mesh\n- Material: Woven\n- Weight: 860g",
        "price": 34.99,
        "tags": [
            "trunkbag"
        ],
        "id": "0615b286-f3d7-4867-a0e1-626628207f0e"
    },
    {
        "name": "Velocity Xplorer TrunkPak",
        "shortDescription": "A versatile trunk bag designed to fit a wide range of cargo that quickly and securely mounts to compatible Xplorer racks.",
        "description": "## Overview\nMake your bike rides more convenient and enjoyable with the Velocity Xplorer TrunkPak. This trunk bag offers simple and secure on-bike storage that can be easily installed and removed without the need for tools. It features multiple pockets for easy organization, a durable design with reflective materials, and a built-in rain cover to protect you and your gear in all weather conditions.\n\nProduct Details\n- Xplorer mounting system provides secure and integrated mounting with compatible racks.\n- Front and rear black reflective materials enhance visibility while adding a touch of style.\n- Stay organized with an internal mesh pocket and two side pockets, each equipped with a smaller internal pocket.\n- The zippered pocket with a soft lining ensures secure phone storage, easily accessible from the top of the bag.\n- Be prepared for any weather with the integrated rain cover securely stowed in the rear pocket.\n- Light loop included for convenient rear light mounting.\n- Adjustable carrying strap for convenient off-bike use.\n\n## Features\nFunctionality, Performance, and Style\n\nVelocity City Utility bags, Velocity City Shopping Trunk bags, and Velocity Panniers transform any bike into a stylish and practical utility ride. The use of high-end fabrics and thoughtful finishing materials delivers the perfect balance of great looks and excellent functionality.\n\nXplorer: Unmatched Mounting System\n\nXplorer racks and bags feature an innovative keyed installation system that ensures your bags stay securely attached to your rack while still allowing for easy removal when needed.\n\nHow Xplorer Works\n\nSimply slide the Xplorer bag onto the Xplorer rack. Once you hear a click, the installation is complete. To remove the bag, insert the key and press. The bag can then be easily taken off.\n\nBetter Together\n\nOur bags and racks are designed as a complete system, making installation and removal hassle-free while ensuring the safety and security of your precious cargo.\n\nIntegrated Light Mounting\n\nFor enhanced visibility during all hours of the day, our racks and trunk bags come with a dedicated spot to securely mount your bike light.\n\n## Specs\n- Cargo capacity: 15L\n- Bag type: Trunk bags\n- Dimensions: 36cm (l) x 19cm (w) x 20cm (h)\n- Attachment: Xplorer\n- Fiber content: 40% Poly 600 PU Coating / 35% Poly 840 PU Coating / 12% 3M Silver Reflective Mesh / 8% Nylon Mesh / 5% Poly Super Nylex Mesh\n- Material: Woven\n- Weight: 900g",
        "price": 21.99,
        "tags": [
            "trunkbag"
        ],
        "id": "de31c206-e0be-44a4-bb30-599832d056fa"
    },
    {
        "name": "Cyclone Xpress Cargo Trunk Bag",
        "shortDescription": "The Cyclone Xpress Cargo Trunk Bag is a versatile biking accessory that offers convenient and secure storage. It features multiple pockets for organization, reflective materials for enhanced visibility, and a built-in rain cover.",
        "description": "## Overview\nEnhance your biking experience with the Cyclone Xpress Cargo Trunk Bag, a versatile accessory that provides convenient and secure storage on your bike. Designed for easy installation and removal without the need for tools, this trunk bag offers multiple pockets for organization, a durable design with reflective materials, and a built-in rain cover to protect your belongings in any weather condition.\n\n## Product Details\n- Compatible with Cyclone MIK racks for secure and integrated mounting\n- Stylish black reflective materials on the front and rear for enhanced visibility\n- Stay organized with an internal mesh pocket and two side pockets, each featuring a smaller internal pocket\n- Convenient zippered pocket with a soft lining for secure phone storage, accessible from the top of the bag\n- Integrated rain cover stowed in a rear pocket ensures protection against rain\n- Light loop for easy mounting of rear lights\n- Adjustable carrying strap for convenient off-bike use\n\n## Features\nFunction, Performance, and Style\nThe Cyclone Xpress Cargo Trunk Bag combines functionality, performance, and style. Crafted with high-quality fabrics and thoughtful finishing materials, this bag delivers a perfect blend of great looks and great functionality.\n\nMIK: Mounting is Key\nThe Cyclone MIK system features a unique keyed installation system that securely attaches the bag to the rack while allowing for easy removal when needed.\n\nHow MIK works\nSimply slide the Cyclone MIK bag onto the Cyclone MIK rack. Once you hear a click, the installation is complete. To remove the bag, insert the key and press. The bag can then be easily detached.\n\nBetter Together\nOur bags and racks are designed as one complete system, ensuring easy installation and removal while keeping your precious cargo secure.\n\nIntegrated Light Mounting\nFor improved visibility during all hours, the Cyclone Xpress Cargo Trunk Bag provides a dedicated spot for mounting your light on both racks and trunk bags.\n\n## Specs\n- Cargo capacity: 15L\n- Bag type: Trunk bags\n- Dimensions: 37cm (l) x 21cm (w) x 20cm (h)\n- Attachment: Cyclone MIK\n- Fiber content: 40% Poly 600 PU Coating / 25% Poly 840 PU Coating / 15% 3M Silver Reflective Mesh / 10% Nylon Mesh / 10% Poly Super Nylex Mesh\n- Material: Woven\n- Weight: 880g",
        "price": 54.99,
        "tags": [
            "trunkbag"
        ],
        "id": "ae640b1c-9379-40d1-bc2e-d9e4f86a3623"
    },
    {
        "name": "VelozRide CargoMax Trunk Storage Bag",
        "shortDescription": "A versatile trunk storage bag designed to provide secure and convenient on-bike storage for a wide range of cargo. The CargoMax easily mounts to compatible racks, ensuring a quick and tool-free installation process.",
        "description": "## Overview\n\nMaximize your cycling experience with the CargoMax Trunk Storage Bag. Whether you're running errands or going on an adventure, this bag offers simple and secure storage that keeps you organized. It features multiple pockets, durable materials with reflective accents, and a built-in rain cover to protect your gear in various weather conditions.\n\n### Product Details\n\n- Compatibility: Easily mounts to compatible VelozRide racks\n- Reflective Accents: Enhance visibility with front and rear reflective materials\n- Organization: Internal mesh pocket and two side pockets, each with a smaller internal pocket for easy organization\n- Phone Storage: Zippered pocket with soft lining provides secure storage accessible from the top of the bag\n- Weather Protection: Integrated rain cover securely stowed in rear pocket\n- Light Mount: Built-in light loop for easy rear light attachment\n- Versatility: Adjustable carrying strap for convenient off-bike use\n\n### Features\n\nFunctionality, performance, and style come together in the CargoMax Trunk Storage Bag. VelozRide offers high-quality materials and meticulous finishing for a perfect blend of functionality and aesthetics.\n\n#### VelozRide Compatibility\n\nThe CargoMax Trunk Storage Bag utilizes an innovative mounting system designed specifically for VelozRide racks. This secure and integrated mounting system ensures a hassle-free installation process and easy removal when needed.\n\n##### How it Works\n\nSimply slide the CargoMax bag onto the VelozRide rack. Once you hear a click, the installation is complete. To remove the bag, insert the key and press the release mechanism. The bag can then be effortlessly detached from the rack.\n\n#### Better Together\n\nVelozRide bags and racks are engineered as a complete system, providing seamless integration and maximum security for your valuable cargo.\n\n#### Integrated Light Mounting\n\nFor enhanced visibility during all hours of the day, VelozRide trunk bags and racks feature a dedicated spot to mount your rear light.\n\n## Specifications\n\n- Cargo Capacity: 12L\n- Bag Type: Trunk storage bag\n- Dimensions: 36cm (l) x 22cm (w) x 20cm (h)\n- Attachment: VelozRide mounting system\n- Material: Woven fabric\n- Weight: 900g",
        "price": 18.99,
        "tags": [
            "trunkbag"
        ],
        "id": "ca74f75f-7623-4b72-a22d-a969709fb81a"
    },
    {
        "name": "VeloRide VersaRack Cargo System",
        "shortDescription": "A versatile cargo system designed to provide convenient on-bike storage for a variety of items, compatible with VeloRide racks.",
        "description": "## Overview\nMake your bike rides more enjoyable and practical with the VeloRide VersaRack Cargo System. This innovative accessory offers a secure and hassle-free way to transport your belongings on your bike. With its user-friendly design and durable construction, you can trust the VersaRack to safely carry your cargo wherever you go. \n\nProduct Details\n- Compatible with VeloRide racks, ensuring a seamless and secure mounting experience\n- Sleek and stylish design with reflective elements for enhanced visibility and safety\n- Multiple storage pockets for efficient organization, including a spacious main compartment, side pockets, and an internal mesh pocket\n- Dedicated zippered pocket with a soft lining for secure and easy access to your phone\n- Integrated rain cover stored in a rear pocket to protect your belongings from the elements\n- Convenient light loop for easy rear light attachment\n- Adjustable carrying strap for effortless off-bike use\n\nFeatures\nFunctionality, Performance, and Style\nThe VeloRide VersaRack Cargo System combines functionality, performance, and style. Its high-quality materials and thoughtful finishing touches ensure both practicality and aesthetics.\n\nVeloRide Mounting System\nThe innovative VeloRide mounting system allows for easy and secure installation of the VersaRack. Simply slide the cargo system onto the VeloRide rack and hear the click to confirm the installation. Removing the cargo system is just as effortless with the use of the provided key.\n\nPerfect Fit\nThe VeloRide VersaRack Cargo System is designed to seamlessly integrate with VeloRide racks. The bags and racks are developed as a complete system to ensure a secure fit and protect your valuable cargo.\n\nIntegrated Light Mounting\nFor enhanced visibility during all hours of the day, the VersaRack Cargo System features a dedicated spot for mounting your bike light on both the racks and trunk bags.\n\nSpecs\n- Cargo Capacity: 15L\n- Bag Type: Trunk bags\n- Dimensions: 40cm (L) x 18cm (W) x 20cm (H)\n- Attachment: VeloRide Mounting System\n- Material: Durable Woven Fabric\n- Weight: 900g",
        "price": 30.99,
        "tags": [
            "trunkbag"
        ],
        "id": "b6b24e3a-3604-41a3-9a63-375e8bd0543c"
    },
    {
        "name": "Zephyr AirCharge Floor Pump",
        "shortDescription": "",
        "description": "## Overview\nMake tubeless setup a breeze with the Zephyr AirCharge Floor Pump. This innovative bike accessory combines the functionality of a floor pump and a tubeless setup tool, allowing you to easily inflate tubeless ready (TLR) tires at home or on the go. With its user-friendly design and accurate pressure readings, the Zephyr AirCharge Floor Pump is a must-have for any cyclist.\n\n## Product Details\n- Dual-chamber design with Inflate setting for traditional floor pump use\n- Charge setting allows for pressurized chamber inflation of tubeless ready tires\n- Backlit digital gauge for easy-to-read pressure measurements up to 160 PSI\n- Compatible with both Presta and Schrader valves\n- Convenient storage for included inflation accessories\n\n## Features\n### Dual-Chamber Design\nThe Zephyr AirCharge Floor Pump features a dual-chamber design that allows it to function as both a traditional floor pump and an air compressor. Switch between the Inflate setting for regular pumping or the Charge setting for pressurized chamber inflation of tubeless tires.\n\n### Tubeless Setup Made Easy\nSay goodbye to the hassle of using a bulky air compressor for tubeless tire setup. The Zephyr AirCharge Floor Pump's Charge setting allows you to store compressed air in the chamber and release it with a simple flip of a lever to seat tubeless tire beads on a rim.\n\n### Accurate Digital Gauge\nNo more guessing the pressure of your tires. The Zephyr AirCharge Floor Pump is equipped with a backlit digital gauge that provides easy-to-read and accurate pressure measurements up to the maximum of 160 PSI. Always ride with confidence knowing your tires are properly inflated.\n\n### Versatile Valve Compatibility\nWhether you ride with Presta or Schrader valves, the Zephyr AirCharge Floor Pump has you covered. Its dual valve compatibility ensures that you can easily inflate your tires regardless of the valve type.\n\n### Convenient Storage\nNever lose track of your inflation accessories again. The Zephyr AirCharge Floor Pump features integrated storage in the handle, keeping all your attachments organized and easily accessible. From basketballs to pool toys, you'll always have the right attachment on hand.\n\n## Specifications\n- Pump Type: Floor\n- Valve Compatibility: Presta/Schrader\n- Gauge Type: Digital\n- Maximum Pressure: 160 PSI\n- Frame Mountable: No",
        "price": 35.99,
        "tags": [
            "pump"
        ],
        "id": "c42420a5-e042-413f-be91-26a149fcb247"
    },
    {
        "name": "SwiftAir TQX Tubeless Charge Pump",
        "shortDescription": "",
        "description": "## Overview\nThe SwiftAir TQX Tubeless Charge Pump is a versatile bike accessory that combines the functionality of a floor pump with a tubeless setup tool. With its innovative design, it simplifies the process of setting up tubeless tires both at home and on-the-go. Featuring a user-friendly interface and durable construction, the SwiftAir TQX is a reliable companion for any cyclist.\n\n## Product Details\n- Dual-function design: The SwiftAir TQX can be used as a standard floor pump for regular inflation or switched to the \"Charge\" mode to pressurize a chamber for effortless tubeless tire setup.\n- Compact and portable: Designed for easy transport, this pump is lightweight and compact, making it convenient to bring along on rides.\n- High-precision digital gauge: Equipped with a digital gauge, the SwiftAir TQX provides accurate pressure readings up to a maximum of 160 PSI, ensuring optimal tire inflation.\n- Compatible with multiple valves: The pump is compatible with both Presta and Schrader valves, allowing for versatile use on a variety of bikes.\n- Convenient storage: The SwiftAir TQX features built-in storage for inflation accessories, ensuring that everything you need is always within reach.\n\n## Features\n### Dual-Function Design\nThe SwiftAir TQX serves as both a floor pump and a tubeless setup tool, offering versatility and convenience for cyclists. Whether you need to inflate your tires or set up tubeless, this pump has got you covered.\n\n### Effortless Tubeless Setup\nWith the \"Charge\" mode, the SwiftAir TQX pressurizes a chamber to help seat tubeless tires without the need for a bulky air compressor. This innovative feature saves time and effort, allowing for hassle-free tubeless setup.\n\n### Accurate Digital Gauge\nThe high-precision digital gauge on the SwiftAir TQX ensures accurate pressure readings. With its backlit display, the gauge is easy to read even in low light conditions. The maximum pressure of 160 PSI provides compatibility with a wide range of tire setups.\n\n### Versatile Valve Compatibility\nThe SwiftAir TQX is compatible with both Presta and Schrader valves, catering to different bike models and allowing for easy switching between valve types.\n\n### Integrated Storage\nThe pump is designed with integrated storage, ensuring that all necessary inflation accessories are conveniently stored within the handle. No more searching for misplaced attachments, as everything is neatly organized and readily accessible.\n\n## Specifications\n- Pump Type: Floor\n- Valve Compatibility: Presta and Schrader\n- Gauge Type: Digital\n- Maximum Pressure: 160 PSI\n- Frame Mounted: No",
        "price": 57.99,
        "tags": [
            "pump"
        ],
        "id": "6330b405-19f2-4489-bc9f-390135a612ab"
    },
    {
        "name": "BikeMax InflaCharge Floor Pump",
        "shortDescription": "",
        "description": "## Overview\nThe BikeMax InflaCharge is a versatile floor pump designed to make tubeless tire setup and daily inflation tasks easier. This pump combines the functionality of a standard floor pump and a tubeless setup tool, eliminating the need for a separate air compressor. With its convenient features and high-pressure capabilities, the InflaCharge is the ultimate accessory for cyclists.\n\n## Product Details\n- Dual-chamber design with an \"Inflate\" setting for efficient use as a traditional floor pump.\n- \"Charge\" setting allows for pressurizing a chamber to easily seat tubeless tires without an air compressor.\n- Backlit digital gauge provides accurate pressure readings up to a maximum of 160 PSI.\n- Compatible with both Presta and Schrader valves for versatile use with different bike tires.\n- Inflation accessories conveniently stored in the handle for easy access and organization.\n\n## Features\n\n### All-in-One Pump Solution\nThe BikeMax InflaCharge eliminates the need for multiple pumps or additional tools. Its dual-chamber design allows it to function as both a standard floor pump and a tubeless setup tool, making it a versatile accessory for all your inflation needs.\n\n### Tubeless Tire Setup Made Easy\nSay goodbye to the hassle of using bulky air compressors for seating tubeless tires. The InflaCharge's \"Charge\" setting pressurizes a chamber, which can be quickly released to seat tubeless tire beads on a rim. This innovative feature simplifies the tubeless setup process.\n\n### Accurate Pressure Readings\nThe backlit digital gauge provides easy-to-read and precise pressure measurements up to 160 PSI. This ensures that you achieve the optimal tire pressure for a smooth and efficient ride.\n\n### Convenient Handle Storage\nNo more searching for misplaced attachments! The InflaCharge's handle-integrated storage keeps all the inflation accessories secure and easily accessible. Whether you need to inflate basketballs, pool toys, or other items, you'll always know where to find the necessary attachments.\n\n### Pump Up with Confidence\nWhen inflating tubeless tires, reaching the recommended pressure is crucial. The InflaCharge's digital gauge signals you're ready to go by displaying three dashes on the screen once the chamber reaches the maximum 160 PSI. This feature provides peace of mind and ensures a secure tubeless setup.\n\n## Specifications\n- Pump Type: Floor\n- Valve: Presta/Schrader\n- Gauge Type: Digital\n- Maximum Pressure: 160 PSI\n- Frame Mounted: No",
        "price": 38.99,
        "tags": [
            "pump"
        ],
        "id": "7dc1b4f0-182d-4516-88d4-b128b0f4198c"
    },
    {
        "name": "GlideGear AirSeal Tubeless Inflator",
        "shortDescription": "",
        "description": "## Overview\nThe GlideGear AirSeal is a revolutionary bike accessory that combines the functionality of a floor pump with a tubeless tire inflator. It makes the process of setting up tubeless tires at home or on the go simple and hassle-free. Equipped with innovative features and a sleek design, the AirSeal is the ultimate companion for every cyclist.\n\n## Product Details\n- Dual-function design: The AirSeal functions as a traditional floor pump for daily use and can be switched to a tubeless tire inflator mode.\n- Effortless tubeless setup: When set to \"Inflate\", the AirSeal operates as a regular floor pump, allowing you to easily inflate your tires.\n- Tubeless tire charging: Switching the AirSeal to \"Charge\" mode creates a pressurized chamber, enabling the inflator to seat tubeless tires without the need for an air compressor.\n- Accurate pressure readings: The AirSeal features a clear, easy-to-read digital gauge that provides accurate pressure readings up to a maximum of 120 PSI.\n- Versatile valve compatibility: It is compatible with both Presta and Schrader valves, making it suitable for a wide range of bikes.\n- Convenient storage: The AirSeal includes a built-in storage compartment in the handle, ensuring that all inflation accessories are easily accessible and neatly organized.\n\n## Features\n- Dual-chamber design: The AirSeal's innovative dual-chamber design allows it to function as both a floor pump and a tubeless tire inflator, providing versatility and convenience.\n- Tubeless tire seating: With the \"Charge\" mode, the AirSeal pressurizes the chamber, enabling efficient and effective seating of tubeless tires without the need for additional equipment.\n- Easy-to-read digital gauge: The AirSeal's digital gauge provides clear and accurate pressure readings, ensuring precise tire inflation.\n- Valve compatibility: The AirSeal is compatible with both Presta and Schrader valves, making it suitable for all types of bikes.\n- Integrated storage: The handle of the AirSeal features a built-in storage compartment, allowing for convenient and organized storage of inflation accessories.\n- Sleek and ergonomic design: The AirSeal boasts a sleek and ergonomic design, ensuring a comfortable and effortless pumping experience.\n\n## Specifications\n- Pump type: Floor\n- Valve compatibility: Presta/Schrader\n- Gauge type: Digital\n- Max pressure: 120 PSI\n- Frame mounted: No",
        "price": 99.99,
        "tags": [
            "pump"
        ],
        "id": "d61bde95-90b7-4339-9925-16cff172ff54"
    },
    {
        "name": "CycleCharge Pro Tubeless Tire Inflator",
        "shortDescription": "",
        "description": "## Overview\nThe CycleCharge Pro is a versatile bike accessory that combines the functionality of a floor pump and a tubeless tire inflator in one compact design. With its innovative features, it simplifies the process of setting up tubeless tires and provides a convenient solution for daily tire inflation.\n\n## Product Details\n- Dual-functionality: The CycleCharge Pro can be used as a traditional floor pump for regular tire inflation and as a tubeless tire inflator for hassle-free setup.\n- Tubeless ready: The pump features a specialized mode called \"Tubeless Charge\" which pressurizes a chamber to quickly seat tubeless tires without the need for an air compressor.\n- Digital pressure gauge: A clear and easy-to-read digital gauge displays accurate pressure readings up to a maximum of 150 PSI, ensuring precise inflation for your bike tires.\n- Compatible with Presta and Schrader valves: The CycleCharge Pro supports both valve types, allowing for seamless use with various bike models.\n- Convenient storage: The pump is designed with integrated storage compartments in the handle, providing a convenient space to store small attachments like needles and adaptors for inflating sports balls and other items.\n- Sturdy construction: Built with durable materials, the CycleCharge Pro is designed to withstand regular use and provide long-lasting performance.\n\n## Features\n1. Dual-functionality: Combines the functionality of a floor pump and a tubeless tire inflator for versatile use.\n2. Tubeless Charge mode: Allows for quick and efficient tubeless tire setup without the need for an air compressor.\n3. Digital pressure gauge: Provides accurate pressure readings up to a maximum of 150 PSI.\n4. Presta and Schrader valve compatibility: Ensures compatibility with a wide range of bike models.\n5. Integrated storage compartments: Conveniently stores small attachments for inflating various items.\n6. Sturdy construction: Made with durable materials for long-lasting performance.\n\n## Specifications\n- Pump type: Floor\n- Valve compatibility: Presta/Schrader\n- Gauge type: Digital\n- Max pressure: 150 PSI\n- Frame mounted: No",
        "price": 129.99,
        "tags": [
            "pump"
        ],
        "id": "412078c5-36f8-4b2d-810f-3ade3881f1c5"
    },
    {
        "name": "Velobright Commuter Pro X1 BeamLight Set",
        "shortDescription": "",
        "description": "## Overview\nLight up your ride with the Velobright Commuter Pro X1 BeamLight Set. This high-performance light set combines the power of a Daytime Running Light with a focused front beam that illuminates the path ahead without blinding oncoming riders. With advanced features like a visible fuel gauge, wireless connectivity, and a chargeback function, this light set is designed to enhance your visibility and convenience on every ride. Complete with the Flare RT top light package, the Velobright Commuter Pro X1 BeamLight Set ensures that you'll be seen from any angle.\n\n## Product Details\n- Daytime Running Light visibility combined with a bright Commuter Pro X1 front light\n- Focused front beam, designed to keep light on the ground ahead and prevent blinding oncoming riders\n- Flare RT provides ultimate visibility for any road, city, or path\n- Specifically designed focus, flash, and range patterns for daytime visibility up to 2km\n- Commuter Pro X1 modes: high 1000LM — 1.5hrs, low 500LM — 3hrs, day flash 300 LM — 12hrs\n- Flare RT Flash modes: 90LM — 6hrs, 45LM — 12hrs, 5LM — 15hrs; Steady modes: 25LM — 4.5hrs, 5LM — 13.5hrs\n- Blendr-compatible for integrated mounting on compatible Blendr stems, helmets, and helmet mounts\n- USB-rechargeable with included USB-C and micro USB cable\n\n## Features\n1. High Beam: Illuminate the entire path with a bright 1000 lumen high beam setting, perfect for mountain biking.\n2. Wireless Connection: Wirelessly pair with Flare RT for single-button power-up on both front and rear lights.\n3. Fuel Gauge: Dual-fuel gauge clearly displays the available battery life of the lights.\n4. Chargeback with USB-C: USB-C charging port supports chargeback, allowing you to recharge your phone or cycling computer on the go.\n5. Weather-Ready: Durable design ensures water resistance for worry-free riding in any weather.\n6. Kindbeam: Helps direct light towards the road while avoiding blinding oncoming riders.\n7. Flash, Focus, Range: Designed with specific focus, flash, and range patterns to maximize visibility during the day.\n8. Blendr Compatibility: Offers seamless integration with compatible Blendr stems, ensuring a clean and secure mount.\n9. Compatibility: Check our compatibility chart to ensure proper compatibility with your bike and accessories.\n\n## Specifications\n- Battery: Li-Ion 21700 3.6Vdc 4800mAh 17.28Wh\n- Rechargeable: Yes\n- Charge Time: 4 hours for full charge, 2 hours for rapid charge\n- Dimensions: 117.4 L x 31.2 W x 40.3 H (mm)\n- Waterproof Rating: IPX4\n- Wireless Compatibility: ANT+ / Bluetooth\n- Weight: 257g",
        "price": 189.99,
        "tags": [
            "bikelight"
        ],
        "id": "5045305d-0bec-496b-aca9-e1e1c3771956"
    },
    {
        "name": "Urban Commuter BeamPro RT FlareX Bike Light Set",
        "shortDescription": "",
        "description": "## Overview\nIlluminate your ride with the Urban Commuter BeamPro RT FlareX Bike Light Set. This high-quality light set combines a powerful front light with an ultra-bright rear light to provide enhanced visibility and safety during your urban commutes. With advanced features such as daytime running lights, intelligent beam projection, and wireless connectivity, this light set ensures that you can see and be seen on the road.\n\n## Product Details\n- High-quality front and rear light set designed specifically for urban commuters.\n- Front light equipped with a powerful BeamPro RT beam projection technology for optimal visibility.\n- Rear light features the FlareX ultra-bright LED for maximum visibility from the rear.\n- Daytime running light mode with specific flash patterns designed for increased visibility during the day.\n- Multiple brightness settings for both front and rear lights to suit different riding conditions.\n- Wireless connectivity allows for easy pairing of front and rear lights for synchronized operation.\n- Built-in rechargeable batteries with USB-C charging capability for convenient charging.\n- Compact and lightweight design for easy mounting and transport.\n- Weather-resistant construction to withstand various weather conditions.\n- Compatible with a range of bike mounts and accessories for versatile mounting options.\n- Battery life indicator for convenient monitoring of remaining battery power.\n\n## Features\n- BeamPro RT Technology: Intelligent beam projection technology ensures optimal visibility while preventing blinding oncoming riders.\n- Daytime Running Light: Specifically designed flash patterns for enhanced visibility during the day, up to a distance of 2km.\n- Wireless Connectivity: Easily pair and control both front and rear lights with a single button press for synchronized operation.\n- USB-C Rechargeable: Built-in rechargeable batteries with USB-C charging port for fast and convenient charging.\n- Weather-Resistant: IPX4 waterproof rating to withstand rain and other adverse weather conditions.\n- Compact and Lightweight: Compact design and lightweight construction for easy installation and transport.\n- Battery Life Indicator: Clear fuel gauge display to monitor remaining battery power.\n- Mounting Compatibility: Compatible with a range of bike mounts and accessories for versatile mounting options.\n\n## Specifications\n- Battery Type: Lithium-Ion\n- Battery Capacity: 4800mAh\n- Battery Voltage: 3.6Vdc\n- Rechargeable: Yes\n- Charge Time: 4 hours (front light), 2 hours (rear light)\n- Dimensions (front light): 117.4mm (L) x 31.2mm (W) x 40.3mm (H)\n- Dimensions (rear light): [specify dimensions]\n- Waterproof Rating: IPX4\n- Wireless Compatibility: ANT+, Bluetooth\n- Weight: 257g (combined weight of front and rear lights)",
        "price": 159.99,
        "tags": [
            "bikelight"
        ],
        "id": "2cd5cbd0-4d5b-4ec8-bfcf-fdc4f4a4c6dc"
    },
    {
        "name": "Commute Pro Plus Light System",
        "shortDescription": "",
        "description": "## Overview\nThe Commute Pro Plus Light System is a high-quality bike accessory designed to enhance visibility and safety during your rides. This set combines the power of the Commute Pro Plus front light with the functionality of the Rear Flare RT light. With features like daytime running lights, wireless connectivity, and chargeback capability, this light system provides an optimal lighting solution for both day and night rides.\n\n## Product Details\n- Commute Pro Plus front light with focused beam and Kindbeam technology to direct light on the ground without blinding oncoming riders\n- Rear Flare RT light for enhanced visibility in any riding conditions\n- Daytime visibility with specific flash patterns designed to be seen up to 2km away\n- Commute Pro Plus modes: high beam 1000LM - 1.5hrs, low beam 500LM - 3hrs, day flash 300LM - 12hrs\n- Rear Flare RT flash modes: 90LM - 6hrs, 45LM - 12hrs, 5LM - 15hrs, steady modes: 25LM - 4.5hrs, 5LM - 13.5hrs\n- Blendr-compatible for easy and integrated mounting on compatible Blendr stems, helmets, and helmet mounts\n- USB-rechargeable with included USB-C and micro USB cable\n\n## Features\n1. High Beam: Illuminate your path with a powerful 1000 lumen high beam setting, perfect for off-road cycling.\n2. Wireless Connectivity: Wirelessly connect the front and rear lights for easy power-up with a single button.\n3. Fuel Gauge: Dual fuel gauge displays the remaining battery life of both lights, keeping you informed.\n4. Chargeback with USB-C: The USB-C charging port allows you to charge your phone or cycling computer on the go.\n5. Weather-Ready: Designed to withstand various weather conditions, ensuring durability and reliability.\n6. Kindbeam: Innovative Kindbeam technology keeps the light focused on the ground, preventing it from blinding other riders.\n7. Flash, Focus, Range: The light system features specific flash, focus, and range settings to maximize visibility during the day.\n8. Seamless Mounting: The Blendr mount offers a clean and seamless mounting option for Blendr compatible stems, providing proper light orientation when using a cycling computer above.\n9. Compatibility: Check our compatibility chart to ensure proper compatibility with your bike and accessories.\n\n## Specifications\n- Battery: Li-Ion 21700 3.6Vdc 4800mAh 17.28Wh\n- Rechargeable: Yes\n- Charge Time: 4 hours for front light, 2 hours for rear light\n- Dimensions: 117.4 L x 31.2 W x 40.3 H (mm)\n- Waterproof Rating: IPX4\n- Wireless Compatibility: ANT+ / Bluetooth\n- Weight: 257g",
        "price": 172.99,
        "tags": [
            "bikelight"
        ],
        "id": "65af2605-12f3-4c67-b0e7-88059b0d7e07"
    },
    {
        "name": "CommutePro RT BeamPro Bike Light Set",
        "shortDescription": "",
        "description": "## Overview\nStay visible and light up your path with the CommutePro RT BeamPro Bike Light Set. This set includes the CommutePro RT front light and the BeamPro rear light, providing you with the perfect combination of visibility and illumination. The CommutePro RT features a unique beam technology that keeps the light on the ground ahead of you without blinding oncoming riders, ensuring a safe and comfortable ride. With multiple modes, a rechargeable battery, and wireless connectivity, this light set is perfect for all your commuting needs.\n\n## Product Details\n- CommutePro RT front light with BeamPro rear light for maximum visibility and illumination\n- Unique beam technology keeps the light on the ground ahead of you, avoiding blinding oncoming riders\n- Multiple modes for different lighting needs: high beam, low beam, and flash\n- Rechargeable battery for convenience and sustainability\n- Wireless connectivity allows for easy pairing and control of both lights\n- Lightweight and compact design for easy installation and portability\n- Waterproof rating of IPX4 ensures durability and functionality in all weather conditions\n- Compatible with ANT+ and Bluetooth wireless protocols for seamless integration with other devices\n- Weight: 257g\n\n## Features\n1. High Beam: Illuminate the path ahead with a bright and powerful high beam setting, perfect for night rides or off-road adventures.\n2. Wireless Connectivity: Pair the front and rear lights wirelessly for synchronized control and easy power-up.\n3. Rechargeable Battery: The built-in Li-Ion battery can be easily recharged using the included USB cable, eliminating the need for disposable batteries.\n4. Chargeback Function: Use the light as a battery bank to charge your gadgets on the go, ensuring you never run out of power.\n5. Weather-Ready: Designed to withstand the elements, the CommutePro RT BeamPro Bike Light Set is waterproof and weather-resistant.\n6. Beam Technology: The unique beam technology of the CommutePro RT ensures that the light stays on the ground ahead of you, providing optimal visibility without disturbing oncoming riders.\n7. Multiple Lighting Modes: Choose from high beam, low beam, and flash modes to suit different riding conditions and preferences.\n8. Lightweight and Compact: The CommutePro RT BeamPro Bike Light Set is designed to be lightweight and compact, making it easy to install and carry.\n9. Easy Mounting: The set is compatible with various mounting options, including handlebars, helmets, and helmet mounts, for a seamless and secure attachment to your bike.\n\n## Specifications\n- Battery: Li-Ion 21700 3.6Vdc 4800mAh 17.28Wh\n- Rechargeable: Yes\n- Charge Time: 4 hours / 2 hours\n- Dimensions: 117.4 L x 31.2 W x 40.3 H (mm)\n- Waterproof Rating: IPX4\n- Wireless Compatibility: ANT+ / Bluetooth\n- Weight: 257g",
        "price": 94.99,
        "tags": [
            "bikelight"
        ],
        "id": "04deda76-0b51-4389-88d8-d695ad91ac0f"
    },
    {
        "name": "Commuter Pro BeamMax RT Bike Light Set",
        "shortDescription": "",
        "description": "## Overview\nThe Commuter Pro BeamMax RT Bike Light Set is the perfect accessory for cyclists who prioritize safety and visibility. This set combines the BeamMax RT front light and the Flare RT rear light, ensuring that you can see the road ahead and be seen by others, day or night. With advanced features like a unique beam pattern, wireless connectivity, USB-rechargeability, and weather-resistant design, this bike light set is designed to enhance your cycling experience and keep you safe on the road.\n\n## Product Details\n- BeamMax RT front light provides a powerful beam that illuminates the road ahead while avoiding blinding oncoming riders.\n- Flare RT rear light offers ultimate visibility for any type of road or path.\n- Specifically designed beam pattern with focus, flash, and range settings for maximum visibility during the day.\n- BeamMax RT modes: high beam 1000 lumens - 1.5 hours, low beam 500 lumens - 3 hours, day flash 300 lumens - 12 hours.\n- Flare RT flash modes: 90 lumens - 6 hours, 45 lumens - 12 hours, 5 lumens - 15 hours. Steady modes: 25 lumens - 4.5 hours, 5 lumens - 13.5 hours.\n- Compatible with Blendr stems, helmets, and helmet mounts for integrated and clean mounting options.\n- USB-rechargeable with included USB-C and micro USB cable.\n\n## Features\n1. High Beam: Illuminate the road with a powerful 1000 lumen high beam setting, perfect for off-road or low-light conditions.\n2. Wireless Connectivity: Wirelessly pair the front and rear lights for convenient single-button power control.\n3. Fuel Gauge: Dual-fuel gauge displays the battery life of both lights, ensuring you always know when it's time to recharge.\n4. USB-C Chargeback: The USB-C charging port allows you to use the front light as a battery bank to recharge your gadgets on the go.\n5. Weather-Ready: Designed with a durable and weather-resistant construction, this light set can withstand various weather conditions.\n6. BeamMax RT with Kindbeam: Kindbeam technology directs the light towards the ground, ensuring optimal visibility without blinding oncoming riders.\n7. Flash, Focus, Range: The unique beam pattern of the front light is specifically designed for daytime visibility, making you visible from a meaningful distance.\n8. Blendr-Compatible: Offers seamless and clean mounting options on Blendr-compatible stems, ensuring proper orientation of the light when using a cycling computer above.\n\n## Specifications\n- Battery: Rechargeable Li-Ion 21700 3.6Vdc 4800mAh 17.28Wh\n- Rechargeable: Yes\n- Charge Time: 4 hours for front light, 2 hours for rear light\n- Dimensions: 117.4 L x 31.2 W x 40.3 H (mm)\n- Waterproof Rating: IPX4\n- Wireless Compatibility: ANT+ / Bluetooth\n- Weight: 257g",
        "price": 105.99,
        "tags": [
            "bikelight"
        ],
        "id": "a93cb75e-2b2b-49aa-9ccc-a56056f3c77d"
    },
    {
        "name": "VelocityAir MIPS Road Bike Helmet",
        "shortDescription": "",
        "description": "## Overview\nExperience the perfect balance of speed, comfort, and safety with the VelocityAir MIPS Road Bike Helmet. Designed to elevate your road racing experience, this helmet offers exceptional performance and protection. With its advanced features and lightweight design, the VelocityAir MIPS is engineered for podium-worthy performance.\n\n## Product Details\n- Lightweight construction reduces weight and enhances comfort for an effortless ride.\n- Optimized ventilation system improves airflow, keeping you cool and maximizing your speed.\n- MIPS Air safety system integrated for enhanced protection against rotational forces.\n- Customizable fit with a single-lace BOA® fit system, providing a secure 360° fit.\n- Convenient rubberized storage port for sunglasses when not in use.\n- Beveled front edge expands your field of view for optimal visibility while riding in various positions.\n- Crash Replacement Guarantee offers a free helmet replacement within the first year in case of a crash.\n- 30-Day Unconditional Guarantee allows for hassle-free returns if you're unsatisfied for any reason.\n\n## Features\n### Ultralight Construction\n- Utilizes cutting-edge materials and components to minimize weight for a faster and more comfortable ride.\n- Incorporates OCLV Carbon inlay to reduce grams and enhance overall performance.\n\n### Advanced Ventilation\n- Multiple rounds of computational fluid dynamics modeling and wind tunnel testing ensure maximum airflow.\n- Designed to keep you 38% cooler* and save you 18 seconds at 45 km/h compared to previous models.\n\n### MIPS Air Safety System\n- Provides seamless integration of MIPS technology for enhanced protection against rotational forces.\n- Delivers improved sweat management for a comfortable and secure fit.\n- Offers lightweight construction without compromising safety.\n\n### BOA® Fit System\n- Features a single-lace design and 360° adjustability for a customized fit.\n- Two lace height positions and three yoke positions enable complete customization for the perfect fit.\n\n### Secure Storage\n- Equipped with rubberized side vents for easy and secure storage of sunglasses while cycling.\n\n### Expanded Field of View\n- Beveled edge design above the brow increases the field of view for better visibility.\n- Allows you to easily see the road ahead, even when in a tucked position.\n\n### Virginia Tech 5-STAR Rating\n- Independently tested and awarded a 5-STAR safety rating by Virginia Tech's reputable third-party testing facility.\n- Ensures the highest level of protection for cyclists.\n\n## Specifications\n| Size     |      Circumference     | Fit System |    Pad Material    |    Buckle Type     |          Includes          | Weight |\n|----------|:----------------------:|:----------:|:------------------:|:------------------:|:--------------------------:|:------:|\n|   S      |     51-57cm (20\"-22\")  |    BOA®    | Moisture Wicking   | Lightweight Buckle | Crash Replacement Guarantee, travel bag |  240g  |\n|   M      |     54-60cm (21\"-24\")  |    BOA®    | Moisture Wicking   | Lightweight Buckle | Crash Replacement Guarantee, travel bag |  260g  |\n|   L      |     58-63cm (23\"-25\")  |    BOA®    | Moisture Wicking   | Lightweight Buckle | Crash Replacement Guarantee, travel bag |  285g  |\n\n## Sizing\n| Size |    Circumference   |\n|:----:|:------------------:|\n|   S  | 51 - 57 cm (20\" - 22\") |\n|   M  | 54 - 60 cm (21\" - 24\") |\n|   L  | 58 - 63 cm (23\" - 25\") |",
        "price": 84.99,
        "tags": [
            "helmet"
        ],
        "id": "425f164e-6596-499d-9019-3d9bcb6aacaa"
    },
    {
        "name": "Velocity Pro-X Road Bike Helmet",
        "shortDescription": "An innovative road bike helmet that combines lightweight design, enhanced ventilation, and advanced safety features for a fast and secure riding experience.",
        "description": "## Overview\nLightweight, sleek, and aerodynamic, the Velocity Pro-X Road Bike Helmet is designed to optimize performance and protection. With its advanced ventilation system and state-of-the-art safety features, this helmet ensures a comfortable and secure ride for road cycling enthusiasts.\n\nProduct Details:\n- Lightweight construction for improved speed and comfort\n- Enhanced ventilation system for superior airflow and cooling\n- Advanced safety features for maximum protection\n- Adjustable fit system for a customizable and secure fit\n- Convenient storage options for sunglasses\n- Wide field of view for improved visibility\n- Crash Replacement Guarantee for added peace of mind\n- 30-Day Satisfaction Guarantee for customer satisfaction\n\n## Features\n1. Lightweight Design:\n   - Incorporates high-quality materials to reduce weight and enhance speed.\n   - Streamlined profile and optimized components ensure a lightweight feel without compromising safety.\n\n2. Enhanced Ventilation System:\n   - Strategically placed vents and channels to maximize airflow and keep riders cool during intense rides.\n   - Improved sweat management for added comfort and performance.\n\n3. Advanced Safety Features:\n   - Utilizes a cutting-edge impact protection system to mitigate rotational forces and enhance overall safety.\n   - Provides reliable head protection for road cycling accidents.\n\n4. Adjustable Fit System:\n   - Equipped with a user-friendly fit system that allows riders to customize the helmet's fit.\n   - Provides a secure and comfortable fit, ensuring optimal protection.\n\n5. Convenient Storage Options:\n   - Features a dedicated docking port for securely storing sunglasses during rides.\n   - Easy and quick access to sunglasses without compromising safety or convenience.\n\n6. Wide Field of View:\n   - Unique beveled design above the brow enhances the rider's field of view.\n   - Ensures excellent visibility, especially when in riding positions such as hoods or drops.\n\n7. Crash Replacement Guarantee:\n   - Provides a free helmet replacement within the first year of ownership if involved in a crash.\n   - Demonstrates our commitment to customer safety and satisfaction.\n\n## Specifications\n| Size          | S                      | M                      | L                      |\n|---------------|------------------------|------------------------|------------------------|\n| Circumference | 52-56cm                | 55-59cm                | 58-62cm                |\n| Fit system    | Adjustable BOA system  | Adjustable BOA system  | Adjustable BOA system  |\n| Pad material  | Moisture-wicking pads  | Moisture-wicking pads  | Moisture-wicking pads  |\n| Buckle type   | Lightweight buckle     | Lightweight buckle     | Lightweight buckle     |\n| Includes      | Travel bag             | Travel bag             | Travel bag             |\n| Weight        | 250g                   | 270g                   | 290g                   |\n\n## Sizing\n| Size |   Circumference  |\n|:----:|:----------------:|\n|   S  | 52 - 56 cm 20\"-22\" |\n|   M  | 55 - 59 cm 21.5\"-23\" |\n|   L  | 58 - 62 cm 23\"-24.5\" |",
        "price": 140.99,
        "tags": [
            "helmet"
        ],
        "id": "5f694765-e3c6-4dfe-b8a4-b9c09393532f"
    },
    {
        "name": "Swift AeroFlow Bike Helmet",
        "shortDescription": "",
        "description": "## Overview\nSpeed and style meet in the Swift AeroFlow Bike Helmet. Designed for road racing and optimized for aerodynamics, this helmet combines lightweight construction, advanced ventilation, and a sleek design to enhance your performance on the road. The Swift AeroFlow also prioritizes safety with an integrated rotational force management system, ensuring maximum protection during any ride.\n\nProduct details:\n- Lightweight construction for optimal speed and comfort\n- Enhanced ventilation system for improved airflow and cooling\n- Integrated rotational force management system for enhanced safety\n- Adjustable fit system for a personalized, secure fit\n- Convenient sunglasses storage port for easy access on the go\n- Wide field of view design for better visibility\n- Crash Replacement Guarantee for added peace of mind\n- 30-Day Money-Back Guarantee for customer satisfaction\n\n## Features\n1. Aerodynamic Design: The Swift AeroFlow features an aerodynamic shape and sleek profile to reduce drag and improve speed. Its advanced design has been tested in wind tunnels for optimal performance.\n\n2. Ventilation System: Designed with multiple vents and specialized channeling, the helmet provides efficient airflow to keep you cool during intense rides. The improved ventilation system allows air to flow through the helmet, preventing overheating.\n\n3. Rotational Force Management System: The integrated rotational force management system provides additional protection by minimizing the rotational forces that can occur during an impact. This technology helps reduce the risk of head injuries.\n\n4. Adjustable Fit System: The Swift AeroFlow offers an adjustable fit system to ensure a comfortable and secure fit. The system utilizes a dial or similar mechanism that allows for easy adjustments to customize the helmet's fit according to your head shape and size.\n\n5. Sunglasses Storage Port: The helmet includes a convenient sunglasses storage port, equipped with a rubberized grip, to securely hold your sunglasses when not in use. This feature allows you to easily access and store your sunglasses during your ride.\n\n6. Wide Field of View: The Swift AeroFlow is designed with a beveled front edge that improves your field of view, providing better visibility while riding in various positions. This feature enhances safety by allowing you to see the road ahead without obstruction.\n\n7. Crash Replacement Guarantee: We stand behind the durability and performance of the Swift AeroFlow. In the unfortunate event of a crash within the first year of ownership, we offer a Crash Replacement Guarantee, providing a free helmet replacement.\n\n8. 30-Day Money-Back Guarantee: Customer satisfaction is our top priority. If you are unsatisfied with your Swift AeroFlow for any reason, you can return it within 30 days of purchase for a full refund.\n\n## Specs\n| Size          |    Small    |   Medium   |    Large    |\n|---------------|-------------|------------|-------------|\n| Circumference | 51-56 cm    | 55-60 cm   | 59-64 cm    |\n| Fit system    | Adjustable  | Adjustable | Adjustable  |\n| Pad material  | Moisture-wicking pads | Moisture-wicking pads | Moisture-wicking pads |\n| Buckle type   | Lightweight buckle | Lightweight buckle | Lightweight buckle |\n| Includes      | Crash Replacement Guarantee, travel bag | Crash Replacement Guarantee, travel bag | Crash Replacement Guarantee, travel bag |\n| Weight        | 250g        | 270g       | 290g        |\n\n## Sizing\n| Size |     Circumference    |\n|:----:|:--------------------:|\n|   S  | 51 - 56 cm           |\n|   M  | 55 - 60 cm           |\n|   L  | 59 - 64 cm           |",
        "price": 136.99,
        "tags": [
            "helmet"
        ],
        "id": "9e125309-ee63-4ed7-9473-50b6f5ba593c"
    },
    {
        "name": "Swift AeroGuard Road Bike Helmet",
        "shortDescription": "",
        "description": "## Overview\nStay ahead of the pack with the Swift AeroGuard Road Bike Helmet, an innovative accessory designed to provide ultimate speed and protection. This lightweight and aerodynamic helmet is equipped with advanced features to keep you cool, comfortable, and safe on your road racing adventures.\n\nThe AeroGuard helmet incorporates the latest technology to enhance your performance, including a fully-integrated Rotational Impact Protection System (RIPS) for additional safety. With its sleek design and customizable fit, the Swift AeroGuard is the perfect companion for riders looking to dominate the podium.\n\nProduct Details:\n- Designed for road racing, providing optimal performance and protection\n- Lightweight construction for enhanced speed and comfort\n- Advanced ventilation system for improved airflow and temperature regulation\n- Integrated Rotational Impact Protection System (RIPS) for enhanced safety\n- Adjustable fit system for a personalized, secure fit\n- Secure storage for sunglasses or accessories\n- Wide field of view for increased visibility and situational awareness\n- Crash Replacement Guarantee for peace of mind\n- 30-Day Unconditional Guarantee for customer satisfaction\n\n## Features\n\n1. Featherlight Design:\n   - Utilizes cutting-edge materials to reduce weight and maximize speed.\n   - Strategically placed carbon fiber components for enhanced strength and durability.\n\n2. Optimal Airflow:\n   - Innovative ventilation system with optimized channeling for improved airflow and cooling.\n   - Enhanced heat dissipation technology for a comfortable ride in any conditions.\n\n3. Rotational Impact Protection System (RIPS):\n   - Fully-integrated RIPS technology to minimize the effects of rotational forces during impact.\n   - Provides an additional layer of protection for your head and brain.\n\n4. Customizable Fit System:\n   - Advanced fit system allows for easy adjustment and customization.\n   - Ensures a secure and comfortable fit for riders of all head shapes and sizes.\n\n5. Secure Storage Solution:\n   - Integrated storage port for securely stowing sunglasses or small accessories during rides.\n   - Easy access and secure storage for added convenience.\n\n6. Wide Field of View:\n   - Beveled front edge design provides an expanded field of view while riding in various positions.\n   - Allows for better visibility and awareness of the road ahead.\n\n7. Independent Safety Rating:\n   - Swift AeroGuard has undergone rigorous third-party testing and received a top safety rating.\n   - Ensures optimal protection and peace of mind for riders.\n\n## Specifications\n\n| Size          | S                                 | M                                 | L                                 |\n|---------------|-----------------------------------|-----------------------------------|-----------------------------------|\n| Circumference | 52-58cm                           | 56-61cm                           | 59-64cm                           |\n| Fit System    | Adjustable strap and buckle system | Adjustable strap and buckle system | Adjustable strap and buckle system |\n| Pad Material  | Moisture-wicking, antimicrobial    | Moisture-wicking, antimicrobial    | Moisture-wicking, antimicrobial    |\n| Buckle Type   | Lightweight buckle                | Lightweight buckle                | Lightweight buckle                |\n| Includes      | Crash Replacement Guarantee       | Crash Replacement Guarantee       | Crash Replacement Guarantee       |\n| Weight        | 250g                              | 270g                              | 295g                              |\n\n## Sizing\n| Size |   Circumference  |\n|:----:|:----------------:|\n|   S  | 52 - 58 cm       |\n|   M  | 56 - 61 cm       |\n|   L  | 59 - 64 cm       |",
        "price": 99.99,
        "tags": [
            "helmet"
        ],
        "id": "72e106e7-3b67-46ba-9601-1313dc246b77"
    },
    {
        "name": "TurboSpeed AeroLite Bike Helmet",
        "shortDescription": "",
        "description": "## Overview\nLightweight, aerodynamic, and stylish, the TurboSpeed AeroLite is a high-performance road bike helmet designed to provide maximum comfort and protection. Built for speed and precision, this helmet is perfect for road racing, time trials, and any cyclist seeking an edge.\n\nWith advanced features and innovative design, the TurboSpeed AeroLite guarantees a fast, cool, and secure ride, ensuring that you stay focused on the road ahead.\n\nProduct details\n- Exceptional lightweight construction delivers superior comfort and reduces fatigue\n- Aerodynamic design optimized for minimal wind resistance, allowing you to ride faster and go the extra mile\n- Integrated Mips safety system provides advanced protection against rotational forces\n- Adjustable fit system ensures a personalized, secure fit for every rider\n- Convenient storage solution with a built-in sunglass dock\n- Enhanced field of view with a beveled front edge\n- Crash Replacement Guarantee ensures a free helmet replacement in the event of a crash within the first year\n- 30-Day Unconditional Guarantee for customer satisfaction and peace of mind\n\n## Features\nUltimate lightweight performance\n\nThe TurboSpeed AeroLite is engineered using cutting-edge materials and components to minimize weight, providing exceptional comfort and reducing fatigue during long rides.\n\nUnmatched aerodynamics\n\nExtensive wind tunnel testing and computational fluid dynamics modeling have resulted in an aerodynamic design that delivers significant gains in speed and efficiency, making you faster on the road.\n\nAdvanced Mips safety system\n\nThe integrated Mips technology offers added protection by reducing rotational forces on the brain during angled impacts, ensuring maximum safety without compromising comfort.\n\nCustomizable fit system\n\nEquipped with an adjustable fit system, the TurboSpeed AeroLite allows for easy customization to achieve a secure and comfortable fit. It adapts to your head shape for a personalized riding experience.\n\nSecure and easy storage\n\nThe helmet features a dedicated rubberized dock to securely stow your sunglasses when not in use, preventing loss or damage during rides.\n\nEnhanced field of view\n\nWith a beveled edge design above the brow, the TurboSpeed AeroLite optimizes your field of view, enabling clear visibility of the road ahead in all riding positions.\n\n5-STAR safety rating\n\nThe TurboSpeed AeroLite has undergone rigorous testing at an industry-recognized facility and has received a 5-STAR safety rating, ensuring top-notch protection for cyclists.\n\n## Specs\n| Size     |   S    |   M    |   L    |\n|----------|--------|--------|--------|\n| Head Circumference | 52-56cm | 55-59cm | 58-62cm |\n| Fit system | Customizable Fit System | Customizable Fit System | Customizable Fit System |\n| Pad material | Moisture-wicking pads | Moisture-wicking pads | Moisture-wicking pads |\n| Buckle type | Lightweight buckle | Lightweight buckle | Lightweight buckle |\n| Includes | Crash Replacement Guarantee, travel bag | Crash Replacement Guarantee, travel bag | Crash Replacement Guarantee, travel bag |\n| Weight (approx.) | 230g | 250g | 270g |\n\n## Sizing\n| Size |     Head Circumference    |\n|:----:|:------------------------:|\n|   S  | 52 - 56 cm (20.5\" - 22\") |\n|   M  | 55 - 59 cm (21.6\" - 23.2\") |\n|   L  | 58 - 62 cm (22.8\" - 24.4\") |",
        "price": 108.99,
        "tags": [
            "helmet"
        ],
        "id": "5b79a699-b8bb-459b-8505-276dcdac8232"
    },
    {
        "name": "Frozgo ChillMax 32oz Insulated Water Bottle",
        "shortDescription": "",
        "description": "## Overview\nThe Frozgo ChillMax is a high-performance insulated water bottle designed to keep your water refreshingly cold for extended periods of time. With its generous 32-ounce capacity, you can carry more chilled water to stay hydrated during long rides. The innovative design features a durable screw cap and a no-drop grip ring for enhanced convenience and ease of use.\n\n## Product Details\n- Premium insulated water bottle that ensures long-lasting coldness and leak-free closure\n- Superior insulation technology keeps your water cold twice as long as traditional bottles\n- Screw cap design for secure closure and easy access to hydration\n- No-drop grip ring provides a firm and confident grip, even when wet\n- Designed to fit most standard bottle cages with secure retention\n- Optimized for use with side-load cages for effortless bottle entry and removal\n- Made from high-quality materials that are BPA-free and phthalate-free for your peace of mind\n\n## Features\n1. Enhanced Cooling Performance: The ChillMax is designed to provide superior insulation, keeping your water colder for longer on those scorching hot rides.\n2. Durable Graphics: The bottle graphics are scratch-resistant and fade-resistant, ensuring they look vibrant and fresh mile after mile.\n3. Leak-Proof Design: The screw cap with a secure thread-on closure and easy-open mechanism prevents leaks, so you can focus on your ride without worrying about spills.\n4. Dishwasher Safe: The bottle and cap are dishwasher safe, making cleaning a breeze.\n5. Easy to Hold: The no-drop grip ring offers a textured surface that provides a firm and confident hold, even when your hands are sweaty.\n6. Convenient Size: With its generous 32-ounce capacity, the ChillMax allows you to carry more cold water, reducing the need for frequent refills.\n7. Versatile Compatibility: The bottle is designed to fit most standard bottle cages, ensuring a secure fit during your rides.\n\n## Specifications\n- Size: 32oz (946ml)\n- Insulated: Yes\n- Type: Screw Cap\n- Tethered cap: No\n- Bottle height: 9.5\" (24cm)\n- Weight: 165g",
        "price": 27.99,
        "tags": [
            "bottle"
        ],
        "id": "7ea5ef6a-e92d-480c-b5e7-d86d2f7b6e40"
    },
    {
        "name": "AquaChill 32oz Insulated Water Bottle",
        "shortDescription": "",
        "description": "## Overview\nStay hydrated and refreshed on your long bike rides with the AquaChill 32oz Insulated Water Bottle. This premium water bottle is designed to keep your water cold for extended periods, ensuring you have a constant supply of chilled hydration. With its larger capacity and advanced insulation, the AquaChill is the perfect companion for those hot and demanding rides. The bottle features a secure screw cap, a comfortable grip, and a leak-proof design for hassle-free use.\n\n## Product Details\n- Premium insulated water bottle designed for optimal temperature control and convenience\n- Advanced insulation technology keeps water cold for an extended period\n- Secure screw cap ensures a leak-free closure\n- Ergonomic design with a comfortable grip for easy handling\n- Generous 32oz (946ml) capacity for longer rides without refilling\n- BPA-free and made with high-quality materials for safety and durability\n\n## Features\n1. Enhanced Temperature Control:\n   - Advanced insulation technology keeps your water cold for hours, even on the hottest days.\n2. Leak-Proof Design:\n   - The secure screw cap provides a leak-free closure, preventing any spills or leaks during your ride.\n3. Comfortable Grip:\n   - The bottle's ergonomic design and textured surface ensure a secure and comfortable grip, even when your hands are wet.\n4. Large Capacity:\n   - With its generous 32oz (946ml) capacity, the AquaChill allows you to carry enough water for longer rides without the need for frequent refills.\n5. BPA-Free and Durable:\n   - The bottle is made with high-quality, BPA-free materials that are built to withstand the demands of cycling.\n   \n## Specifications\n- Size: 32oz (946ml)\n- Insulated: Yes\n- Type: Screw Cap\n- Tethered Cap: No\n- Bottle Height: 9.5\" (24cm)\n- Weight: 180g",
        "price": 24.99,
        "tags": [
            "bottle"
        ],
        "id": "c3eee158-eaad-4619-8ad6-11935c31488c"
    },
    {
        "name": "AeroFlow 32oz Hydration Bottle",
        "shortDescription": "",
        "description": "## Overview\nStay hydrated on your bike rides with the AeroFlow 32oz Hydration Bottle. This premium insulated water bottle keeps your drinks cold for longer, allowing you to stay refreshed on those hot and demanding rides. With its larger capacity and ergonomic design, this bottle provides easy and efficient hydration, making it the perfect accessory for cyclists of all levels.\n\n## Product Details\n- Premium insulated bottle designed to keep drinks cold for extended periods\n- Ergonomic shape and size for easy handling and efficient hydration\n- Screw-on cap for secure closure and leak-proof design\n- Lightweight construction for easy carrying on rides\n- BPA-free and food-grade materials ensure safe and clean hydration\n- Designed for easy insertion and removal from bottle cages\n- Compatible with most standard bottle cages\n- Wide mouth opening for easy filling and cleaning\n- Dishwasher safe for convenient and hassle-free maintenance\n\n## Features\n1. Enhanced Insulation:\n   - The AeroFlow bottle features an advanced insulation layer that keeps your drinks cold for an extended period, ensuring refreshing hydration on long rides.\n   \n2. Large Capacity:\n   - With a generous 32oz capacity, this bottle allows you to carry ample hydration to keep you fueled throughout your ride.\n\n3. Leak-Proof Design:\n   - The screw-on cap ensures a secure and leak-proof closure, giving you peace of mind during your ride.\n\n4. Ergonomic Shape:\n   - The bottle's ergonomic design fits comfortably in your hand and offers a secure grip, making it easy to hydrate on the go.\n\n5. Lightweight Construction:\n   - Weighing in at just 141g, the AeroFlow bottle won't add unnecessary weight to your bike, ensuring a smooth and effortless ride.\n\n6. BPA-Free and Food-Grade Materials:\n   - The bottle is made from BPA-free and food-grade materials, guaranteeing safe and clean hydration with no unwanted chemicals.\n\n7. Easy Bottle Cage Compatibility:\n   - Designed for easy insertion and removal from most standard bottle cages, the AeroFlow bottle provides a secure fit for worry-free riding.\n\n8. Wide Mouth Opening:\n   - The wide mouth opening allows for easy filling with ice cubes and effortless cleaning, ensuring a hygienic hydration experience.\n\n9. Dishwasher Safe:\n   - The AeroFlow bottle and cap are dishwasher safe, saving you time and effort on cleaning and maintenance.\n\n## Specifications\n- Size: 32oz (946ml)\n- Insulated: Yes\n- Type: Screw Cap\n- Tethered cap: No\n- Bottle height: 10.25\" (26cm)\n- Weight: 158g",
        "price": 30.99,
        "tags": [
            "bottle"
        ],
        "id": "f1001d18-ca70-48c9-a257-bc32c960ac4c"
    },
    {
        "name": "Velocity Frost 32oz Insulated Water Bottle",
        "shortDescription": "",
        "description": "## Overview\nThe Velocity Frost is a high-performance insulated water bottle designed to keep your drinks cold and refreshing on long bike rides. With its generous 32-ounce capacity, you can carry more hydration with you to stay hydrated for longer. The bottle features a secure screw cap and a sleek design that ensures a leak-free closure and a comfortable grip.\n\n## Product Details\n- Premium insulated bottle that keeps your drinks cold for extended periods and provides leak-free closure\n- Form-fitting insulation layer keeps your drinks cold twice as long as traditional bottles\n- Screw cap with a secure thread-on design ensures no leaks and easy access\n- Lightweight and durable construction for long-lasting use\n- Tethered cap for convenient handling and no risk of misplacement\n- BPA-free and phthalate-free, ensuring safe and healthy hydration\n- Dishwasher safe for easy cleaning and maintenance\n- Fits securely in most standard bottle cages for hassle-free transport\n- Dimensions: 32oz (946ml) capacity, 11.5\" (29cm) height, weight: 150g\n\n## Features\n1. Insulation Performance: The Velocity Frost is designed to keep your drinks icy cold for longer, allowing you to enjoy refreshing hydration throughout your ride.\n2. Leak-Proof Design: The screw cap ensures a secure and leak-free closure, giving you peace of mind when carrying the bottle in your bag or cage.\n3. Ergonomic Grip: The bottle's sleek design and textured surface provide a comfortable and secure grip, even when your hands are wet.\n4. Easy Access: The screw cap allows for easy access to your drinks, so you can stay hydrated on the go without any hassle.\n5. Durable Construction: Made from high-quality materials, the Velocity Frost is built to withstand the rigors of cycling and keep up with your active lifestyle.\n6. Generous Capacity: With its 32-ounce capacity, the bottle lets you carry more hydration, reducing the need for frequent refills on long rides.\n7. Stylish Design: The Velocity Frost features a sleek and modern design with vibrant colors that will make you stand out on the road.\n8. Versatile Compatibility: The bottle fits securely in most standard bottle cages, ensuring a stable and reliable attachment to your bike.\n\n## Conclusion\nThe Velocity Frost 32oz Insulated Water Bottle combines performance, durability, and style to provide cyclists with a reliable hydration solution. With its exceptional insulation capabilities, leak-proof design, and ergonomic grip, this bottle is a must-have accessory for any avid cyclist. Stay refreshed and hydrated on your rides with the Velocity Frost.",
        "price": 18.99,
        "tags": [
            "bottle"
        ],
        "id": "ba8092e2-c779-4ac1-b5ac-111c23d64c2e"
    },
    {
        "name": "Xcel Aqua Freeze 32oz Water Bottle",
        "shortDescription": "",
        "description": "## Overview\nThe Xcel Aqua Freeze is a high-performance insulated water bottle designed to provide cyclists with long-lasting cold refreshment on their rides. With its large 32-ounce capacity, this premium bottle ensures you can stay hydrated for longer. The innovative insulation technology keeps your water cold for extended periods, while the easy-squeeze design and leak-free closure make it convenient to use while on the go.\n\n## Product Details\n- Premium insulated bottle that keeps water cold for longer and offers leak-free closure\n- Advanced insulation technology ensures your water stays cold for extended periods\n- Easy-squeeze design for effortless hydration\n- Secure threaded cap with a simple open-and-close mechanism to prevent leaks\n- Tacky-textured grip surface provides a secure hold even when wet\n- Designed for easy insertion and removal from bottle cages, ensuring a secure fit\n- Compatible with a variety of bottle cages\n- Made from high-quality materials that are free from harmful chemicals such as BPAs and phthalates\n- Dishwasher safe for easy cleaning and maintenance\n\n## Features\n1. Enhanced Insulation: The Aqua Freeze utilizes advanced insulation technology to keep your water cold for an extended period, ensuring you have refreshing hydration throughout your ride.\n2. Durable Graphics: The bottle graphics are designed to withstand scratches and fading, ensuring they look great for miles to come.\n3. Leak-Proof Cap: The secure threaded cap features a reliable open-and-close mechanism that prevents leaks, giving you peace of mind during your rides.\n4. Large Capacity: With a generous 32-ounce capacity, the Aqua Freeze allows you to carry more water, reducing the need for frequent refills.\n5. Easy Grip: The bottle's tacky-textured surface provides a firm and confident grip, even when your hands are wet.\n6. Easy Access: The Aqua Freeze is designed for easy insertion and removal from bottle cages, ensuring a secure fit and convenient access to your hydration while cycling.\n\n## Specifications\n- Size: 32oz (946ml)\n- Insulated: Yes\n- Type: Screw Cap\n- Tethered cap: No\n- Bottle height: 10.5\" (26.7cm)\n- Weight: 160g",
        "price": 16.99,
        "tags": [
            "bottle"
        ],
        "id": "baabf51d-3b6d-47d5-9f34-79ca43df0d7c"
    }
]